In [21]:
import pandas as pd

#initialising variables

files = ["C:/Users/user/Desktop/dataeng_test-master/dataset1.csv", "C:/Users/user/Desktop/dataeng_test-master/dataset2.csv"]
output_file = "C:/Users/user/Desktop/dataeng_test-master/dataset.csv"
dfs = []

# below line of code reads the datafile parameterized in variable files and loads into dataframe df
for file_ in files:
    print(file_)
    dfs.append(pd.read_csv(file_))
df = pd.concat(dfs, ignore_index=True)
 
# splitting the name and assigning into first_name and second_name columns
df['first_name']=df.name.str.split(" ", expand=True)[0]
df['second_name']=df.name.str.split(" ", expand=True)[1]

#delete rows where name is empty or null
df.drop(df[df.name.isna()].index, inplace=True)

#create new column and assign True or False based on the condition price is above 100
df["above_100"]=df["price"].astype(float)>100

#write the dataframe into output csv file
df[["first_name", "second_name", "price", "above_100"]].to_csv(output_file, index=False)

C:/Users/user/Desktop/dataeng_test-master/dataset1.csv
C:/Users/user/Desktop/dataeng_test-master/dataset2.csv

                name       price
0      William Dixon  109.037280
1       Kristen Horn  262.524652
2     Kimberly Chang  187.007258
3          Mary Ball  283.174648
4     Benjamin Craig  143.871582
...              ...         ...
4995  Shirley Nguyen    9.011665
4996     Jesse Brown  247.328232
4997   Valerie Owens  238.103714
4998    Alicia Sharp  243.622929
4999   Sherry Jensen   13.839516

[5000 rows x 2 columns]